{
  "1": {
    "id": 1,
    "name": "Dylan Drost",
    "bio": "Android Developer working a mental health platform (e-health) to communicate, treat and manage clients. Occasional web developer/server admin for https://bettyskitchen.nl a food blog which is run by my wife. The current stack I work with is Android(Java), Symfony(PHP), Docker, Gitlab, Wordpress.",
    "shortBio": "Android developer working on a mental health platform",
    "company": "Karify",
    "country": "The Netherlands",
    "featured": true,
    "photoUrl": "/images/people/dylan_drost.jpeg",
    "socials" : [
      {
        "link" : "https://plus.google.com/+DylanDrost",
        "name" : "Google+",
        "icon" : "gplus"
      },
      {
        "link" : "https://twitter.com/aegis321",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "https://www.facebook.com/dylan.drost",
        "name" : "Facebook",
        "icon" : "facebook"
      },
      {
        "link" : "https://www.linkedin.com/in/dylandrost",
        "name" : "LinkedIn",
        "icon" : "linkedin"
      }
    ],
    "badges" : [],
    "tags": [
      "Android"
    ],
    "title": "Android Developer at Karify"
  },
  "2": {
    "id": 2,
    "email": "sebastian@q42.nl",
    "name": "Sebastian Lobato Genco",
    "bio": "I'm an Android developer with passion for quality testing, architecture and RxJava. I also write articles to share my love for Android: http://bit.ly/2yoSTYT, http://bit.ly/2hIdsHy",
    "shortBio": "I'm an Android developer with passion for quality testing, architecture and RxJava.",
    "company": "Q42",
    "country": "The Netherlands",
    "featured": true,
    "photoUrl": "/images/people/sebas.jpg",
    "socials" : [
      {
        "link" : "https://twitter.com/sebaslogen",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "https://github.com/sebaslogen/",
        "name" : "Github",
        "icon" : "github"
      }
    ],
    "badges" : [],
    "tags": [
      "Android"
    ],
    "title": "Android Developer at Q42"
  },
  "3": {
    "id": 3,
    "email": "bob@kubrickolo.gy",
    "name": "Bob van Luijt",
    "bio": "Bob is a creative technologist and designer who works at the intersection of technology, design, and art. He started his career as a freelance software developer during his art studies, and founded his company Kubrickology right after receiving his bachelor's degree. Bob helps other companies find new business opportunities by implementing and researching new technologies, such as Internet of Things, machine learning, and more. He puts his techniques to work at Kubrickology as well as with the company Firmshift. Bob also blogs and makes tech-art installations, which you can read about on his website - or follow his activity on Github.",
    "shortBio": "Bob is a creative technologist and designer who works at the intersection of technology, design, and art. He started his career as a freelance software developer during his art studies, and founded his company Kubrickology right after receiving his bachelor's degree.",
    "company": "Kubrickology",
    "country": "The Netherlands",
    "featured": true,
    "photoUrl": "/images/people/bobvanluijt.jpg",
    "socials" : [
      {
        "link" : "https://twitter.com/kubrickology",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "https://github.com/bobvanluijt/",
        "name" : "Github",
        "icon" : "github"
      },
      {
        "link" : "https://www.linkedin.com/in/bobvanluijt/",
        "name" : "LinkedIn",
        "icon" : "linkedin"
      },
      {
        "link" : "https://bob.wtf/",
        "name" : "Website",
        "icon" : "website"
      }
    ],
    "badges" : [],
    "tags": [
      "iot"
    ],
    "title": "Google Developer Expert IoT"
  },  
  "4": {
    "id": 4,
    "email": "info@html5test.com",
    "name": "Niels Leenheer",
    "bio": "Niels Leenheer is a self-professed browser geek. He has been hooked on browsers ever since somebody showed him the original Nexus browser on a NeXT Cube back in the dark ages of the internet. Niels is the creator of HTML5test.com and runs one of the largest Open Device Labs in the world. He loves procrastinating, collecting weird devices with even stranger browsers, procrastinating, researching obscure browsers and writing bug reports. For his day job he is CTO of Salonhub and creates web applications for hair salons.",
    "shortBio": "Niels Leenheer is a self-professed browser geek. He has been hooked on browsers ever since somebody showed him the original Nexus browser on a NeXT Cube back in the dark ages of the internet.",
    "company": "HTML5test.com",
    "country": "The Netherlands",
    "featured": false,
    "photoUrl": "/images/people/nielsleenheer.jpeg",
    "socials" : [
      {
        "link" : "https://twitter.com/html5test",
        "name" : "Twitter",
        "icon" : "twitter"
      }
    ],
    "badges" : [],
    "tags": [
      "web", "javascript"
    ],
    "title": ""
  },  
  "5": {
    "id": 5,
    "email": "ivan.maric@infinum.hr",
    "name": "Ivan Maric",
    "bio": "Ivan started working at Infinum during his last year of college. Since then, he has been a part of the Android team that currently counts more than 15 developers. For the last 3 years, he worked on many projects varying from simple quiz and game to more complex, unique apps. Besides striving to crash-free and maintainable development, he had his fair share of turning crazy designer ideas into eye-candy reality. That is why custom views and animations are two topics he's always more than happy to talk about. He regularly speaks at Infinum Android Talks, the largest monthly Android community event in Croatia. Still, his biggest pride is Infinum Student Academy where he has taken part as a full-time mentor and a teacher.",
    "shortBio": "Ivan started working at Infinum during his last year of college. Since then, he has been a part of the Android team that currently counts more than 15 developers.",
    "company": "Infinum",
    "country": "Croatia",
    "featured": false,
    "photoUrl": "/images/people/ivanmaric.jpeg",
    "socials" : [
      {
        "link" : "https://twitter.com/maric_iv",
        "name" : "Twitter",
        "icon" : "twitter"
      }
    ],
    "badges" : [],
    "tags": [
      "android"
    ],
    "title": ""
  },  
  "6": {
    "id": 6,
    "email": "juarezpaf@gmail.com",
    "name": "Juarez Filho",
    "bio": "Passionate about traveling and also to share his adventures with Web Technologies and Firebase. As a Google Developer Expert, he’s helping communities all over the world to learn, discover and have fun.",
    "shortBio": "Passionate about traveling and also to share his adventures with Web Technologies and Firebase. As a Google Developer Expert, he’s helping communities all over the world to learn, discover and have fun.",
    "company": "",
    "country": "Dublin/Ireland",
    "featured": false,
    "photoUrl": "/images/people/juarezfilho.jpeg",
    "socials" : [
      {
        "link" : "https://twitter.com/juarezpaf",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "https://github.com/juarezpaf/",
        "name" : "Github",
        "icon" : "github"
      },
      {
        "link" : "https://www.linkedin.com/in/juarezpaf/",
        "name" : "LinkedIn",
        "icon" : "linkedin"
      }
    ],
    "badges" : [],
    "tags": [
      "firebase", "web"
    ],
    "title": ""
  },  
  "7": {
    "id": 7,
    "email": "rcgroot@gmail.com",
    "name": "René de Groot",
    "bio": "René is a mobile app developer building apps and training developers for Android since Cupcake. He spend that time build apps for banking, insurances, shopping, navigation, home automation, healthcare and more. Android is as much fun as 8 years ago, even more now with Kotlin.",
    "shortBio": "René is a mobile app developer building apps and training developers for Android since Cupcake. He spend that time build apps for banking, insurances, shopping, navigation, home automation, healthcare and more. Android is as much fun as 8 years ago, even more now with Kotlin.",
    "company": "",
    "country": "The Netherlands",
    "featured": false,
    "photoUrl": "/images/people/renedegroot.jpeg",
    "socials" : [
      {
        "link" : "https://twitter.com/rcgroot",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "https://github.com/rcgroot/",
        "name" : "Github",
        "icon" : "github"
      },
      {
        "link" : "https://plus.google.com/u/1/+RenéDeGroot",
        "name" : "Google+",
        "icon" : "gplus"
      }
    ],
    "badges" : [],
    "tags": [
      "android"
    ],
    "title": ""
  },  
  "8": {
    "id": 8,
    "email": "iliev.vesselin@gmail.com",
    "name": "Vesselin Iliev",
    "bio": "Vesselin moved to London 2 years ago to join the Android team at ASOS. An Android developer since Froyo (long long time ago), he’s current focus is combining RxJava, Kotlin and MVP / MVVM patterns to provide smooth and seamless user experiences. Passionate about testing and writing clean code in general. Loves spending his free time cycling, skiing or listening to podcasts.",
    "shortBio": "Vesselin moved to London 2 years ago to join the Android team at ASOS. An Android developer since Froyo (long long time ago), he’s current focus is combining RxJava, Kotlin and MVP / MVVM patterns to provide smooth and seamless user experiences.",
    "company": "ASOS",
    "country": "United Kingdom",
    "featured": false,
    "photoUrl": "/images/people/vesselinlliev.jpg",
    "socials" : [
      {
        "link" : "https://twitter.com/ilievvesselin",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "http://veskoiliev.com/",
        "name" : "Web",
        "icon" : "website"
      }
    ],
    "badges" : [],
    "tags": [
      "android"
    ],
    "title": ""
  },  
  "9": {
    "id": 9,
    "email": "rokesh@google.com",
    "name": "Rokesh Jankie",
    "bio": "",
    "shortBio": "",
    "company": "Google",
    "country": "The Netherlands",
    "featured": false,
    "photoUrl": "/images/people/RokeshJankie.png",
    "socials" : [
      {
        "link" : "https://twitter.com/rjankie",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "https://plus.google.com/+RokeshJankie",
        "name" : "Google+",
        "icon" : "gplus"
      }
    ],
    "badges" : [],
    "tags": [
      "cloud", "ml"
    ],
    "title": ""
  },  
  "10": {
    "id": 10,
    "email": "mail2shubho@gmail.com",
    "name": "Shubhabrata Roy",
    "bio": "Shubhabrata is a senior data scientist in HERE in Netherlands. He has vast experience in working with different domains including text mining, NLP, sentiment analysis. Now he is working on spatial and real-time data. Previously he worked with a start-up in Budapest where he was part of a small team that built the pipeline for the organization dealing with billions of records. Before that he was a doctoral student in ENS lyon in France where he finished worked in signal processing applications.",
    "shortBio": "Shubhabrata is a senior data scientist in HERE in Netherlands. He has vast experience in working with different domains including text mining, NLP, sentiment analysis.",
    "company": "HERE Technology",
    "country": "The Netherlands",
    "featured": false,
    "photoUrl": "/images/people/shubhabrataroy.jpeg",
    "socials" : [
      {
        "link" : "www.linkedin.com/in/shubhabrataroy",
        "name" : "LinkedIn",
        "icon" : "linkedin"
      }
    ],
    "badges" : [],
    "tags": [
      "ml"
    ],
    "title": ""
  },
  "12": {
    "id" : 12,
    "email": "stefan@qlouder.com",
    "name" : "Stefan Hogendoorn",
    "bio" : "Google Developer Expert & Firebase Expert Stefan Hogendoorn is driven by technique and has a passion for Cloud Computing. At Qlouder he is responsible for all technical aspects during projects as Chief Geek of the company. He also coaches new developers and is the lead innovative architect. Stefan has a background in ICT for over 20 years. He has worked (amongst others) on the integration of Google Apps and the Google Cloud Platform, and developed many small and large business apps. Furthermore, he has a lot of experience with cross-disciplinary projects, both national and international. In addition he has a strong online presence and he speaks regularly at events where he shares his knowledge, experience and enthusiasm on (Google) technology with fellow developers around the whole world. As a highly creative technical entrepreneur his motto is: people are fun, but code makes more sense. <br>Stefan is one of the two owners of Qlouder (2012). Qlouder is a Google Cloud Platform partner and aims to deliver continuous value to organizations. This value can be defined in many ways, for example incremental improvements to existing products, the creation of entirely new products and services, or reducing costs by means of Google Apps for Work, the Google Cloud Platform and custom-build applications. Qlouder advises, builds, implements and offers support.",
    "shortBio" : "Google Developer Expert & Firebase Expert Stefan Hogendoorn is driven by technique and has a passion for Cloud Computing. At Qlouder he is responsible for all technical aspects during projects as Chief Geek of the company.",
    "company" : "Qlouder",
    "country" : "The Netherlands",
    "featured" : false,
    "photoUrl" : "../images/people/stefanhogendoorn.jpeg",
    "socials" : [
      {
          "icon" : "twitter",
          "link" : "https://twitter.com/shogendoorn"
      },        
      {
          "icon": "linkedin",
          "link": "https://nl.linkedin.com/in/stefanhogendoorn"
      }
    ],
    "badges" : [],
    "tags" : [
        "cloud"
    ]
  },
  "13": {
    "id" : 13,
    "email": "novakovskiy@google.com",
    "name" : "Dmitriy Novakovskiy",
    "bio" : "Dmitriy is a Sales Engineer at Google, where he supports customers in their journeys to scalable & automated cloud infrastructure. Prior to Google, Dmitriy held a variety of Product Management, Sales Engineering and Solution Architecture roles at Mirantis, working in cloud (OpenStack) and containerization (Kubernetes) domains. At his spare time Dmitriy enjoys traveling and great choice of music events offered by The Netherlands all year round.",
    "shortBio" : "Dmitriy is a Sales Engineer at Google, where he supports customers in their journeys to scalable & automated cloud infrastructure.",
    "company" : "Google",
    "country" : "The Netherlands",
    "featured" : false,
    "photoUrl" : "../images/people/dmitriynovakovskiy.jpg",
    "socials" : [  
      {
          "icon": "linkedin",
          "link": "https://www.linkedin.com/in/dmitriynovakovskiy/"
      }
    ],
    "badges" : [],
    "tags" : [
        "cloud"
    ]
  },
  "14": {
    "id" : 14,
    "email": "k@djodjo.org",
    "name" : "Kalin Maldzhanski",
    "bio" : "Kalin is a freelance consultant and entrepreneur who loves technology, automation, optimization and confrontation. He has a great passion for Android, REST APIs, Open Linked Data and distributed systems. ",
    "shortBio" : "Kalin is a freelance consultant and entrepreneur who loves technology, automation, optimization and confrontation. He has a great passion for Android, REST APIs, Open Linked Data and distributed systems. ",
    "company" : "Linked.Farm",
    "country" : "Belgium",
    "featured" : false,
    "photoUrl" : "../images/people/kalinmaldzhanski.jpeg",
    "socials" : [  
      {
        "link" : "https://twitter.com/djodjoni",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "https://github.com/djodjoni/",
        "name" : "Github",
        "icon" : "github"
      },
      {
        "link" : "https://www.linkedin.com/in/kalmal/",
        "name" : "LinkedIn",
        "icon" : "linkedin"
      }
    ],
    "badges" : [],
    "tags" : [
        "Android"
    ]
  },
  "15": {
    "id" : 15,
    "email": "ykaitao@gmail.com",
    "name" : "Kai-Tao Yang",
    "bio" : "Kaitao Yang works as a Data Scientist & Deep Learning Expert at eBay (Amsterdam). Before he joining eBay, he worked as a Deep Learning Engineer at Jheronimus Academy of Data Science. He obtained his Professional Doctorate in Engineering (PDEng) from the Electrical Engineering department of Technische Universiteit Eindhoven, and his Master from the Cognitive Science department of Xiamen University, in 2016 and 2012, respectively. He has a mastery of popular Deep Learning models (CNNs, Sequential models, Generative models), with experience in applying these models to process both structured data (e.g., sql, csv) and unstructured data (e.g., image, text, biomedical signals, and accelerometer data). In addition, he is actively offering lectures on Deep Learning, as seen from here: https://www.linkedin.com/feed/update/urn:li:activity:6285216778280927233.",
    "shortBio" : "Kaitao Yang works as a Data Scientist & Deep Learning Expert at eBay (Amsterdam). Before he joining eBay, he worked as a Deep Learning Engineer at Jheronimus Academy of Data Science.",
    "company" : "DL-APPLIED",
    "country" : "The Netherlands",
    "featured" : false,
    "photoUrl" : "../images/people/kaitaoyang.jpeg",
    "socials" : [],
    "badges" : [],
    "tags" : [
        "cloud", "ml"
    ]
  },
  "16": {
    "id" : 16,
    "email": "designatednerd@gmail.com",
    "name" : "Ellen Shapiro",
    "bio" : "Ellen Shapiro is a native mobile developer who recently moved to Nijmegen. She's been building iOS and Android apps since 2010, and was most recently the lead mobile developer for SpotHero. In addition, Ellen writes and edits iOS and Android tutorials for RayWenderlich.com, and is the lead developer for Hum, a prominent iOS app for songwriting. In her spare time Ellen enjoys playing the guitar, traveling, biking, and hanging out with her girlfriend and their two cats. ",
    "shortBio" : "Ellen Shapiro is a native mobile developer who recently moved to Nijmegen. She's been building iOS and Android apps since 2010, and was most recently the lead mobile developer for SpotHero.",
    "company" : "",
    "country" : "The Netherlands",
    "featured" : false,
    "photoUrl" : "../images/people/ellenshapiro.jpeg",
    "socials" : [
      {
        "link" : "https://twitter.com/DesignatedNerd",
        "name" : "Twitter",
        "icon" : "twitter"
      }
    ],
    "badges" : [],
    "tags" : [
        "android"
    ]
  },
  "17": {
    "id" : 17,
    "email": "tinsukesuzuki@gmail.com",
    "name" : "Ângelo Suzuki",
    "bio" : "Ângelo Suzuki is an Android Developer at BUX. After starting as an all-around mobile developer, his pragmatic approach lead him to focus on Android due to the general openness and hackability of the platform. Ângelo is happy when he is working in a snappy and uncluttered App, decreasing his App size and compilation time, playing PC games or enjoying life with his partner.",
    "shortBio" : "Ângelo Suzuki is an Android Developer at BUX. After starting as an all-around mobile developer, his pragmatic approach lead him to focus on Android due to the general openness and hackability of the platform.",
    "company" : "",
    "country" : "The Netherlands",
    "featured" : false,
    "photoUrl" : "../images/people/angelosuzuki.jpeg",
    "socials" : [
      {
        "link" : "https://github.com/tinsukE",
        "name" : "Github",
        "icon" : "github"
      },
      {
        "link" : "https://plus.google.com/+%C3%82ngeloSuzuki",
        "name" : "Google+",
        "icon" : "gplus"
      },
      {
        "link" : "https://twitter.com/tinsukesuzuki",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "https://tinsuke.wordpress.com/",
        "name" : "Web",
        "icon" : "website"
      },
      {
        "link" : "https://www.linkedin.com/in/angelosuzuki/",
        "name" : "LinkedIn",
        "icon" : "linkedin"
      }
    ],
    "badges" : [],
    "tags" : [
        "android"
    ]
  },
  "18": {
    "id" : 18,
    "email": "gema.parreno.piqueras@gmail.com",
    "name" : "Gema Parreño Piqueras",
    "bio" : "Gema Parreño Piqueras is a Spanish programmer & data scientist at BBVA who has designed Deep Asteroid, a network to detect the impact of asteroids on Earth. The project was a finalist in the global competition for the NASA Space App Challenge 2016 in May and was selected as one of the use cases for Google in Keynote Google I/O 2017. In addition to one of the developers of significant examples of the TensorFlow project she is a technical contributor to other projects as Artificial Intelligence pysc2 of Deepmind",
    "shortBio" : "Gema Parreño Piqueras is a Spanish programmer & data scientist at BBVA who has designed Deep Asteroid, a network to detect the impact of asteroids on Earth.",
    "company" : "BBVA",
    "country" : "Spain",
    "featured" : false,
    "photoUrl" : "../images/people/gemaparreñopiqueras.jpeg",
    "socials" : [
      {
        "link" : "https://twitter.com/SoyGema",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "https://nl.linkedin.com/in/gemaparreno",
        "name" : "LinkedIn",
        "icon" : "linkedin"
      }
    ],
    "badges" : [],
    "tags" : [
      "tensorflow"
    ]
  },
  "19": {
    "id" : 19,
    "email": "Milo.van.der.Zee@ahold.com",
    "name" : "Milo van der Zee",
    "bio" : "Milo is genetically programmed to be a techy. In his early ages he wreaked havoc in the household by taking everything apart and not being able to put things together again. After a lot of programming, tinkering and studying he got his master degree in information-technology and started working as network engineer, ran a couple of veterinary practices and went back to programming. As of 2017 he is working at Ahold and helps maintaining the on-premise Kubernetes cloud platform.",
    "shortBio" : "Milo is genetically programmed to be a techy. In his early ages he wreaked havoc in the household by taking everything apart and not being able to put things together again.",
    "company" : "Albert Heijn - Online",
    "country" : "The Netherlands",
    "featured" : false,
    "photoUrl" : "../images/people/milovanderzee.png",
    "socials" : [
      {
        "link" : "http://www.vanderzee.org",
        "name" : "Web",
        "icon" : "website"
      },
      {
        "link" : "https://www.linkedin.com/in/milo-van-der-zee-a608b44a/",
        "name" : "LinkedIn",
        "icon" : "linkedin"
      }
    ],
    "badges" : [],
    "tags" : [
        "cloud", "kubernetes"
    ]
  },
  "20": {
    "id" : 20,
    "email": "m.knobbout@wearetriple.com",
    "name" : "Max Knobbout",
    "bio" : "Max Knobbout holds a PhD in Artificial Intelligence and is currently lead of the AI team at Triple. Triple is a partner for some of Holland’s leading brands, and the company focusses on everything \"digital\": From concept to strategy to design, apps to optimization, virtual reality to cloud management and cloud services. As you may expect, doing AI in such an innovative environment is both challenging and a lot of fun, since you are constantly working on new ideas using state-of-the-art AI techniques while working closely together with the customer.",
    "shortBio" : "Max Knobbout holds a PhD in Artificial Intelligence and is currently lead of the AI team at Triple.",
    "company" : "Triple",
    "country" : "The Netherlands",
    "featured" : false,
    "photoUrl" : "../images/people/maxknobbout.jpeg",
    "socials" : [
      {
        "link" : "https://www.linkedin.com/in/max-knobbout-670354101/",
        "name" : "LinkedIn",
        "icon" : "linkedin"
      }
    ],
    "badges" : [],
    "tags" : [ 
      "ai" 
    ]
  },
  "21": {
    "id" : 21,
    "email": "ihor@linux.com",
    "name" : "Ihor Dvoretskyi",
    "bio" : "Ihor is a Developer Advocate at Cloud Native Computing Foundation (under Linux Foundation governance), focused on the Kubernetes-related efforts at the open source community. He acts as a Product Manager at Kubernetes community, co-leading Product Management Special Interest Group; together with co-leading OpenStack Special Interest Group, related to OpenStack and Kubernetes collaboration and integration questions. Being a Linux user since 2005, and having a deep engineering background, Ihor has been responsible the for projects tightly bound to the Cloud Computing area, containerized workloads and Linux systems.",
    "shortBio" : "Ihor is a Developer Advocate at Cloud Native Computing Foundation (under Linux Foundation governance), focused on the Kubernetes-related efforts at the open source community.",
    "company" : "Cloud Native Computing Foundation",
    "country" : "Ukraine",
    "featured" : false,
    "photoUrl" : "../images/people/ihordvoretskyi.jpeg",
    "socials" : [
      {
        "link" : "https://github.com/idvoretskyi",
        "name" : "Github",
        "icon" : "github"
      },
      {
        "link" : "https://plus.google.com/103000293055760527954",
        "name" : "Google+",
        "icon" : "gplus"
      },
      {
        "link" : "https://twitter.com/idvoretskyi",
        "name" : "Twitter",
        "icon" : "twitter"
      },
      {
        "link" : "https://idvoretskyi.com",
        "name" : "Web",
        "icon" : "website"
      },
      {
        "link" : "https://nl.linkedin.com/in/idvoretskyi",
        "name" : "LinkedIn",
        "icon" : "linkedin"
      }
    ],
    "badges" : [],
    "tags" : [
      "cloud"
    ]
  }
}
